// Задача 25 Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. Задание должно быть выполнено в методе. В методе не должно быть вывода в консоль.

void Degree (int a, int b)
{
    double c = Math.Pow(a,b);
    Console.WriteLine(c);
}

Degree(2,3);
